emacs/.emacs.d/jasper-emacs.org
*** 增强 embark 和 consult，批量搜索替换大杀器
:PROPERTIES:
:CUSTOM_ID: h:learn-completion-minibuffer-4-1
:END:

我的emacs模块配置[[#h:completion-minibuffer-4-1][(=init-completion.el= 增强 embark 和 consult，批量搜索替换大杀)]]

性能： grep < ack < ag < ripgrep(rg)

使用ripgrep来进行搜索, =M-x consult-ripqgrep= 搜索hello 会出现报错找不到rg命令。

#+begin_example
Error running timer: (file-missing "Searching for program" "No such file or directory" "rg")
#+end_example

下载ripgrep: <https://github.com/BurntSushi/ripgrep> msys2 <https://packages.msys2.org/base/mingw-w64-ripgrep>

安装方式：
- PC msys2 ~pacman -S mingw-w64-x86_64-ripgrep~
- PC github release 下载windows包，解压并加入到PARH变量中
- Arch Linux  ~sudo pacman -S ripgrep~
- macOS ~brew install ripgrep~

再使用ripgrep来进行搜索, =M-x consult-ripgrep= 搜索hello ，所有当前目录下包含hello字符串的信息都在minibuffer中展示出来了。 使用 =C-n= 或 =C-p= 来预览文件或进入文件里。

*下面介绍批量修改插件*
#+begin_src emacs-lisp
  ;; 批量修改
  (package-install 'embark-consult)
  (package-install 'wgrep)
  (setq wgrep-auto-save-buffer t)

  (eval-after-load 'consult
    '(eval-after-load 'embark
       '(progn
          (require 'embark-consult)
          (add-hook 'embark-collect-mode-hook #'consult-preview-at-point-mode)))) ;hook 第一个参数执行前，先执行第2个参数的功能

  (define-key minibuffer-local-map (kbd "C-c C-e") 'embark-export-write)

  (defun embark-export-write ()
    "Export the current vertico results to a writable buffer if possible.
  Supports exporting consult-grep to wgrep, file to wdeired, and consult-location to occur-edit"
    (interactive)
    (require 'embark)
    (require 'wgrep)
    (pcase-let ((`(,type . ,candidates)
                 (run-hook-with-args-until-success 'embark-candidate-collectors)))
      (pcase type
        ('consult-grep (let ((embark-after-export-hook #'wgrep-change-to-wgrep-mode))
                         (embark-export)))
        ('file (let ((embark-after-export-hook #'wdired-change-to-wdired-mode))
                 (embark-export)))
        ('consult-location (let ((embark-after-export-hook #'occur-edit-mode))
                             (embark-export)))
        (x (user-error "embark category %S doesn't support writable export" x)))))
#+end_src

批量替换操作
- ~M-x consult-ripgrep~  默认会在以 git 为根目录搜索。如 =#hello= ，搜索包含hello字符的文件。 ~C-n/C-p~ 下上搜索同时可以预览。
- ~C-c C-e~ 打开写
- ~M-x query-replace-regexp~ 输入hello 回车， 替换为hello 回车。 按 y 同意当前行替换，n 不同意修改
- ~C-c C-c~ 执行替换，按 q 退出


当前buffer替换操作
- =C-s= 搜索， 输入hello
- =C-c C-e= 编辑
- ~M-x query-replace-regexp~ 输入要替换的内容
- ~C-c C-c~ 执行替换，按 q 退出

*配置搜索中文文件*

everythin工具可以快速搜索本地文件。下载地址： <https://www.voidtools.com/zh-cn/downloads/>

安装好后，同时下载 ES.exe 客户端工具加入环境变量。


#+begin_src emacs-lisp
;;everyting
;;consult-locate
;; 配置搜索中文文件
(progn
  (setq consult-locate-args (encode-coding-string "es.exe -i -p -r" 'gbk))
  (add-to-list 'process-coding-system-alist '("es" gbk . gbk))
  )
(eval-after-load 'consult
  (progn
      (setq
        consult-narrow-key "<"
        consult-line-numbers-widen t
        consult-async-min-input 2         ;; 搜索 2 个字符显示输出。默认 3
        consult-async-refresh-delay  0.15
        consult-async-input-throttle 0.2
        consult-async-input-debounce 0.1)
    ))
#+end_src

操作：
- 前提：PC 始终打开everything, 转为ES会调用everthing
- =M-x consult-locate= 回车，输入要搜索的文件如 =#init.el= 。 可以看到minibuffer中显示的和everthing界面搜索的是一样的。
- 再输入个#号就可以使用 orderless 的功能进行过滤。如只想看29.4中init.el文件 =#init.el#29.4= 选中回车即可打开对应文件

使用外部程序打开：
- =M-x consult-locate= 回车，输入要搜索的文件. 如搜索projeckt中的txt文件 =#\.txt#project=
- 使用embark =C;=  按x使用外部程序打开txt文件

中文搜索操作：
- =M-x consult-locate= 回车，输入要搜索的文件. 如 =#学习=

*** 使用拼音进行搜索
:PROPERTIES:
:CUSTOM_ID: h:learn-tools-search-pinyin
:END:

我的emacs模块配置[[#h:tools-search-pinyin][(=init-tools.el= 使用拼音进行搜索)]]

#+begin_src emacs-lisp
  ;; 使用拼音进行搜索
  (package-install 'pyim)

  (defun eh-orderless-regexp (orig_func component)
    (let ((result (funcall orig_func component)))
      (pyim-cregexp-build result)))


  (defun toggle-chinese-search ()
    (interactive)
    (if (not (advice-member-p #'eh-orderless-regexp 'orderless-regexp))
        (advice-add 'orderless-regexp :around #'eh-orderless-regexp)
      (advice-remove 'orderless-regexp #'eh-orderless-regexp)))

  (defun disable-py-search (&optional args)
    (if (advice-member-p #'eh-orderless-regexp 'orderless-regexp)
        (advice-remove 'orderless-regexp #'eh-orderless-regexp)))

  ;; (advice-add 'exit-minibuffer :after #'disable-py-search)
  (add-hook 'minibuffer-exit-hook 'disable-py-search) ;退出minibuffer时自动退出拼音搜索

  (global-set-key (kbd "s-p") 'toggle-chinese-search) ;需要时打开拼音搜索。因为拼音搜索性能不稳定
#+end_src

中文拼音操作：
- 前提：PC 始终打开everything, 转为ES会调用everthing
- =M-x consult-locate= 回车，输入要搜索的文件. 如打包含“学习”的txt文件 =#\.txt#= 按 =s-p= 输入 =#\.txt#xx=  可以看到过滤学习的txt文件

*** 更换主题

customize theme 内置主题

自带的主题颜色，可以使用 =M-x customize themes= 图形化来选择，或者使用命令 =load-theme 主题= 。如 =M-x load-theme light-blue=

- leuven，我最喜欢的亮色主题之一了。其实它也有暗色主题，只是没有内置。
- modus，应该是从Emacs 28开始内置的一款包含亮/暗色的主题。非常好，我很喜欢。暗色有的时候，我感觉眼睛有点累。

#+begin_src emacs-lisp
  (load-theme 'tango-dark)
#+end_src

** 模块化配置

*** 使用多文件存储配置文件

创建 custom.el 文件

一些自动生成的配置会自动写到这里。默认是写到init.el文件结尾的。

#+begin_src emacs-lisp
  (setq custom-file (expand-file-name "~/custom.el")) ;没有则自动创建
  (load custom-file 'no-error 'no-message)
#+end_src

拆分init.el文件

#+begin_example
  ├── init.el
  ├── lisp
  │  ├── init-basic.el      # 基础配置
  │  ├── init-elpa.el       # 插件源
  │  ├── init-org.el        # org mode
  │  ├── init-recentf.el    # 最近打开文件  
  │  ├── init-site-lisp.el  # 非 elpa 源
  │  ├── init-themes.el     # 主题
  │  └── init-utils.el      # 自定义工具

  #----------
  ├── custom.el
  ├── early-init.el
  ├── init.el
  ├── lisp
  │   ├── init-basic.el           #默认的配置
  │   ├── init-c.el
  │   ├── init-completion.el     #补全
  │   ├── init-const.el
  │   ├── init-custom.el
  │   ├── init-funcs.el          #自定义函数
  │   ├── init-keybindings.el
  │   ├── init-lisp.el
  │   ├── init-org.el
  │   ├── init-package.el        #插件源
  │   ├── init-tools.el
  │   ├── init-ui.el             #视觉相关
  │   └── init-writing.el
#+end_example

加载配置
#+begin_src emacs-lisp
(add-to-list 'load-path
    (expand-file-name (concat user-emacs-directory "lisp")))
#+end_src

各个文件通过 provide 暴露对外调用的名称。如：
#+begin_src emacs-lisp :tangle no :results none
(provide 'init-basic)
#+end_src

然后在 init.el 文件中通过 `require` 调用：
#+begin_src emacs-lisp :tangle no :results none
require 'init-basic
#+end_src

*** 使用Org-mode 管理 Emacs 配置

Org-mode 下的文学编程将颠覆你对于 Emacs 的看法。因为我们也可以使用 Org 来管理 Emacs 的配置文件。

我们可以让我们的配置文件更加清晰有序，并且可以添加很多注释之外的资料、链接等，让我们的配置更加易读和可管理。


- 创建org文件。如 =~/.emacs.d/emacs-config.org=
- 代码块
  它能够自动的将代码块里的代码，写入到指定的文件里去，不指定默认在当前目录生成与文件同名.el文件。
  
  而且它的配置方式也非常灵活：
  - 代码块配置tangle
  - 标题行配置tangle

- 执行 ~M-x org-babel-tangle~ 命令来触发 tangle 这个动作。

范例-代码块配置tangle

#+begin_src sh :tangle no :results none
  ,#+BEGIN_SRC emacs-lisp :tangle ~/.emacs.d/test.el
    (+ 1 2)
  ,#+END_SRC
#+end_src

执行 ~M-x org-babel-tangle~ ，代码 (+ 1 2) 将写入到 ~/.emacs.d/test.el 这个文件里。

范例-标题行配置tangle
#+begin_src sh :tangle no :results none
  ,* early-init.el
  :PROPERTIES:
  :HEADER-ARGS: :tangle early-init.el
  :END
#+end_src

不想写入文件
- 直接在对应代码块或者标题参数行写上 :tangle no
  
*添加代码块*

- 旧版使用快捷键 ~< + 快捷码 + TAB~ 。
  - 如代码块 ~<s + Tab~ 可以直接插入代码块的代码片段（Snippet）
- 从 orgmode 9.2 版本后， ~org-insert-structure-template~ 变为 ~C-c C-,~ 给出列表选择


还想使用旧版快捷键

#+begin_src emacs-lisp
  (with-eval-after-load 'org
    (require 'org-tempo))

  ;; 禁用左尖括号
  (setq electric-pair-inhibit-predicate
        `(lambda (c)
           (if (char-equal c ?\<) t (,electric-pair-inhibit-predicate c))))

  (add-hook 'org-mode-hook
            (lambda ()
              (setq-local electric-pair-inhibit-predicate
                          `(lambda (c)
                             (if (char-equal c ?\<) t (,electric-pair-inhibit-predicate c))))))
#+end_src

** 模块列表

*** 1

*文件搜索键位绑定*

[[#h:keybindings-search-file][我的emacs模块配置(=init-keybindings.el= 文件搜索)]]

*** 2
*一些好用的包*

- restart-emacs

- savehist 记住使用过的命令[[#h:basic-session][(=init-basic.el= 保存会话)]]

- 显示文件行、列、大小 ，美化状态栏
  - simple[[#h:basic-simple][(=init-basic.el= simple)]]
  - keycast[[#h:tools-keycast][(=init-tools.el= keycast)]]
  - doom-modeline [[#h:ui-doom-emacs][(=init-ui.el= doom-emacs)]]
*** 3

- org


** 清理学习内容
#+begin_src emacs-lisp :tangle no
  (write-region "" nil "~/.emacs.d/init.el")
#+end_src


* Emacs初始化 =early-init.el=
:PROPERTIES:
:HEADER-ARGS: :tangle early-init.el
:END:

这是 Emacs 在启动时读取的第一个文件。它应该包含不依赖于任何包或 Emacs 帧比例的代码。初始化文件是为了在 Emacs 生成初始帧之前设置一些基本的东西

** =early-init.el= 对启动时间和垃圾回收的调整

#+begin_src emacs-lisp :tangle "early-init.el"
  (setq gc-cons-threshold (* 50 1000 1000))
#+end_src

** =early-init.el= 初始化包缓存
:PROPERTIES:
:CUSTOM_ID: h:package-cache
:END:


这里使用标准的 =package.el= 来管理我的Emacs包。
([[#h:package.el][=init.el= 配置软件包]])

* Emacs主配置文件 (=init.el=)

#+begin_src emacs-lisp :tangle "init.el"
  ;;; init.el --- The main init entry for Emacs -*- lexical-binding: t -*-
  ;;; Commentary:

  ;; This file bootstraps the configuration, which is divided into
  ;; a number of other files.

  ;;; Code:

  
#+end_src

** =init.el= 基础配置禁用备份和锁定文件

默认情况下，Emacs 会尝试锁定文件，以免它们被其他程序修改。它还保留备份。这些是我不需要的功能

#+begin_src emacs-lisp :tangle "init.el"
  ;; 禁用备份和锁定文件
  (setq make-backup-files nil)
  (setq backup-inhibited nil) ; Not sure if needed, given `make-backup-files'
  (setq create-lockfiles nil)
#+end_src

** =init.el= 指定自定义文件 custom.el

默认情况下，Emacs 将持久自定义写入用户的 init 文件末尾。当用户 =M-x customize= 或与之相关时，Emacs 都会写这些内容。指定自定义文件位置与init.el区分开。

#+begin_src emacs-lisp :tangle "init.el"
  ;; 指定自己义配置
  (setq custom-file (make-temp-file "emacs-custom-")) ;没有则自动创建emacs-custom-开头随机文件
  (load custom-file 'no-error 'no-message)
#+end_src

** =init.el= 始终从 =*scratch*= 缓冲区开始

#+begin_src emacs-lisp :tangle "init.el"
  ;; 始终从 *scratch* 缓冲区开始
  (setq initial-buffer-choice t)
#+end_src

** =init.el= 加载目录
:PROPERTIES:
:CUSTOM_ID: h:i-dir
:END:


加载目录下所有配置
- =list= 目录 :: 各种插件配置
- =person= 目录 :: 个人的配置

在 =init.el= 配置中调用插件[[#h:i-modules][(=init.el= 加载各模块)]]
  

#+begin_src emacs-lisp :tangle "init.el"
  ;; 加载目录
  (mapc
   (lambda (string)
     (add-to-list 'load-path (locate-user-emacs-file string)))
   '("lisp" "person"))
#+end_src

** =init.el= 软件包 (=package.el=)
:PROPERTIES:
:CUSTOM_ID: h:package.el
:END:

package.el 内置于 Emacs 中。我们不需要显式加载它，在需要时会被 use-package 调用。
early-init.el 处激活缓存[[#h:package-cache][(=early-init.el= 初始化包缓存)]]

#+begin_src emacs-lisp :tangle "init.el"
  ;;;; 软件包

  (setq package-vc-register-as-project nil) ; Emacs 30

  ;; 设置插件源优先级
  (require 'package)
  (setq package-check-signature nil 
        load-prefer-newer t) ;; 个别时候会出现签名校验失败
  (setq package-archives
        '(("gnu-elpa" . "https://elpa.gnu.org/packages/")
          ("gnu-elpa-devel" . "https://elpa.gnu.org/devel/")
          ("nongnu" . "https://elpa.nongnu.org/nongnu/")
          ("melpa" . "https://melpa.org/packages/")))

  ;; 最大的数字优先（未提及的优先级为 0）
  (setq package-archive-priorities
        '(("gnu-elpa" . 3)
          ("melpa" . 2)
          ("nongnu" . 1)))

  (unless (bound-and-true-p package--initialized)
    (package-initialize)) ;; 刷新软件源索引

  ;;防止反复调用 package-refresh-contents 会影响加载速度
  (when (not package-archive-contents)
    (package-refresh-contents))
#+end_src

强制指定某些软件的源
#+begin_src emacs-lisp :tangle "init.el"
  (defvar prot-emacs-my-packages
    '(vertico tmr)
    "List of symbols representing the packages I develop/maintain.")

  ;; 指定某些软件使用特点源安装 
  (setq package-pinned-packages
        `(,@(mapcar
             (lambda (package)
               (cons package "gnu-elpa-devel"))
             prot-emacs-my-packages)))
#+end_src

** =init.el= 加载各个模块
:PROPERTIES:
:CUSTOM_ID: h:i-modules
:END:

我把配置拆分为几个模块[[#h:i-dir][(=init.el= 加载目录)]]

各个模块都记录在下面[[#h:modules][我的 Emacs 模块配置]]中


#+begin_src emacs-lisp :tangle "init.el"
  ;; 加载模块
  (load (locate-user-emacs-file "jasper-emacs-pre-custom.el") :no-error :no-message)

  (require 'init-basic)
  (require 'init-packages)
  (use-package benchmark-init
    :ensure t
    :demand t
    :config
    ;; To disable collection of benchmark data after init is done.
    (add-hook 'after-init-hook 'benchmark-init/deactivate))
  (require 'init-evil)
  (require 'init-completion)
  (require 'init-tools)
  (require 'init-ui)
  (require 'init-org)
  (require 'init-keybindings)
  (require 'init-programming)
  (require 'init-window)
  (require 'init-funcs)

  (load (locate-user-emacs-file "jasper-emacs-post-custom.el") :no-error :no-message)
#+end_src

** =init.el= 计算启动时间

#+begin_src emacs-lisp :tangle "init.el"
  (defun efs/display-startup-time ()
    (message "Emacs loaded in %s with %d garbage collections."
             (format "%.2f seconds"
                     (float-time
                     (time-subtract after-init-time before-init-time)))
             gcs-done))

  (add-hook 'emacs-startup-hook #'efs/display-startup-time)


  (setq gc-cons-threshold (* 2 1000 1000))
#+end_src


* 我的Emacs模块配置
:PROPERTIES:
:CUSTOM_ID: h:modules
:END:

=init.el= 部分中，通过 ~load-path~ 让 Emacs 可以运行他们的代码[[#h:i-dir][(=init.el= 加载目录)]]。本章的副标题定义了模块，每个模块都加载在我的 =init.el= 末尾调用[[#h:i-modules][(=init.el= 加载各模块)]]

** =init-basic.el=
