emacs/.emacs.d/jasper-emacs.org
*** =init-basic.el= 一些默认的配置
:PROPERTIES:
:CUSTOM_ID: h:basic-default
:END:

这里涉及到改键[[#h:learn-key][(改键)]]

#+begin_src emacs-lisp :tangle "lisp/init-basic.el" :mkdirp yes
  ;;; 一些默认的配置

  (setq w32-apps-modifier 'super)       ;PC 通过SharpKeys改成了 Application

  ;;; 统一配置
  (global-set-key (kbd "s-a") 'mark-whole-buffer) ;;对应Windows上面的Ctrl-a 全选
  (global-set-key (kbd "s-c") 'kill-ring-save) ;;对应Windows上面的Ctrl-c 复制
  (global-set-key (kbd "s-s") 'save-buffer) ;; 对应Windows上面的Ctrl-s 保存
  (global-set-key (kbd "s-v") 'yank) ;对应Windows上面的Ctrl-v 粘贴
  (global-set-key (kbd "s-z") 'undo) ;对应Windows上面的Ctrol-z 撤销

  ;; 查询函数、变量、key 定义的文件位置
  (global-set-key (kbd "C-h C-f") 'find-function)
  (global-set-key (kbd "C-h C-v") 'find-variable)
  (global-set-key (kbd "C-h C-k") 'find-function-on-key)

  ;; 设置系统的编码，避免各处的乱码
  (prefer-coding-system 'utf-8)
  (set-default-coding-systems 'utf-8)
  (set-terminal-coding-system 'utf-8)
  (set-keyboard-coding-system 'utf-8)
  (setq default-buffer-file-coding-system 'utf-8)

  ;; 开启服务
  ;;(server-mode 1)

  (electric-pair-mode t)                       ; 括号补全
  (add-hook 'prog-mode-hook #'show-paren-mode) ; 编程模式下，光标在括号上时高亮另一个括号
  (delete-selection-mode t)                    ; 选中文本后输入文本会替换文本（更符合我们习惯了的其它编辑器的逻辑。默认选中放后面
  
  (global-auto-revert-mode t)                  ; 自动加载外部修改过的文件
  (setq auto-save-default nil)                 ; 关闭自动保存文件，#为后缀的文件
  (setq ring-bell-function 'ignore)            ; 关闭提示声音
  (fset 'yes-or-no-p 'y-or-n-p)                ;; 某个命令时需要输入 (yes or no)
#+end_src

*** =init-basic.el= 最近编辑过的文件

#+begin_src emacs-lisp :tangle "lisp/init-basic.el"
  ;;; 最近编辑过的文件
  (use-package recentf
    :ensure nil
    :bind (("C-x C-r" . recentf-open-files))
    :hook (after-init . recentf-mode)
    :init (setq recentf-max-saved-items 300
                recentf-exclude
                '("\\.?cache" ".cask" "url" "COMMIT_EDITMSG\\'" "bookmarks"
                  "\\.\\(?:gz\\|gif\\|svg\\|png\\|jpe?g\\|bmp\\|xpm\\)$"
                  "\\.?ido\\.last$" "\\.revive$" "/G?TAGS$" "/.elfeed/"
                  "^/tmp/" "^/var/folders/.+$" "^/ssh:" "/persp-confs/"
                  (lambda (file) (file-in-directory-p file package-user-dir))))
    :config
    (push (expand-file-name recentf-save-file) recentf-exclude)
    (add-to-list 'recentf-filename-handlers #'abbreviate-file-name))
#+end_src

*** =init-basic.el= 保存会话
:PROPERTIES:
:CUSTOM_ID: h:basic-session
:END:

savehist-mode  默认开启，重启 emacs 会记住使用过的命令，同时会保存到 =~/.emacs.d/history= 文件中。 history 文件还保存了 minibuffer 的变量、查找过的文件等。相当于记住了上次的工作状态。

save-place-mode 开启后，会记住光标所在文件的位置，下次打开文件时自动光标指向这个位置


#+begin_src emacs-lisp :tangle "lisp/init-basic.el"
  ;;; Save and restore editor sessions between restarts
  ;; 记住使用过的命令
  (use-package savehist
    :ensure nil
    :hook (after-init . savehist-mode)
    :init (setq enable-recursive-minibuffers t ; Allow commands in minibuffers
                history-length 1000
                savehist-additional-variables '(mark-ring
                                                global-mark-ring
                                                search-ring
                                                regexp-search-ring
                                                extended-command-history)
                savehist-autosave-interval 300)
    )

  ;; 记住光标所在文件的位置
  (use-package saveplace
    :ensure nil
    :hook (after-init . save-place-mode)) ;在emacs配置完全加载好以后，执行save-place-mode
#+end_src

测试：
- 记住光标的位置，重启emacs
- =C-x C-f= 重新打开该文件，可以看到光标是上次退出的位置。

*** =init-basic.el= simple
:PROPERTIES:
:CUSTOM_ID: h:basic-simple
:END:

modeline上显示文件大小、列号

#+begin_src emacs-lisp :tangle "lisp/init-basic.el"
  ;;; modeline上显示文件大小、 列号
  (use-package simple
    :ensure nil
    :hook (after-init . size-indication-mode)
    :init
    (progn
      (setq column-number-mode t)
      ))
#+end_src

*** =init-basic.el= 调用 provide

#+begin_src emacs-lisp :tangle "lisp/init-basic.el"
  (message "Load init-basic done...")
  (provide 'init-basic)
#+end_src

** =init-packages.el=

*** =init-packages.el= 安装

#+begin_src emacs-lisp :tangle "lisp/init-packages.el" :mkdirp yes
  ;; make use-package default behavior better
  ;; with `use-package-always-ensure' you won't need ":ensure t" all the time
  ;; with `use-package-always-defer' you won't need ":defer t" all the time
  (setq use-package-always-ensure t
        use-package-always-defer t
        use-package-enable-imenu-support t
        use-package-expand-minimally t)
  (require 'use-package)
#+end_src

*** =init-package.el= 调用 provide

#+begin_src emacs-lisp :tangle "lisp/init-packages.el"
  (message "Load init-packages done...")
  (provide 'init-packages)
#+end_src

** =init-evil.el=

*** =init-evil.el= 调用 provide

#+begin_src emacs-lisp :tangle "lisp/init-evil.el"
  (message "Load init-evil done...")
  (provide 'init-evil)
#+end_src

** =init-completion.el=

*** =init-completion.el= 内置补全
:PROPERTIES:
:CUSTOM_ID: h:completion-built-in
:END:

在学习章节提到过[[h:learn-completion-built-in][(补全)]]

#+begin_src emacs-lisp :tangle "lisp/init-completion.el" :mkdirp yes
  ;; 内置补全功能n
  ;;(setq tab-always-indent 'complete)           ;; 使用 TAB 来列出当前补全选项
#+end_src

*** =init-completion.el= Company
:PROPERTIES:
:CUSTOM_ID: h:completion-company
:END:

在学习章节提到过[[h:learn-completion-company][(Company插件)]]


他是一个用于代码补全的插件

#+begin_src emacs-lisp :tangle "lisp/init-completion.el"
  (use-package company
    :ensure t
    :init
    (global-company-mode t)                    ;; 全局开启 company 补全
    :config
    (setq company-idle-delay 0)                ;; 补全时间快些
    (setq company-minimum-prefix-length 1)     ;; 最少输入1个字符开启
    (setq company-show-numbers t)              ;; 给选项编号 (按快捷键 M-1、M-2 等等来进行选择)
    (setq company-dabbrev-other-buffers 'all)  ;; 从所有缓冲区收集补全信息
    (setq company-tooltip-align-annotations t) ;; 右侧附加注释
    (setq company-selection-wrap-around t)
    (setq company-transformers '(company-sort-by-occurrence)) ; 根据选择的频率进行排序，如果不喜欢可以去掉
    :bind (:map company-active-map
                ("C-n" . 'company-select-next)
                ("C-p" . 'company-select-previous)))  ;; 使用 `C-n` 与 `C-p` 来选择补全项，默认选择上一条和下一条候选项命令 M-n M-p
#+end_src

*** =init-completion.el= 增强 minibuffer 补全：vertico 和 Orderless
:PROPERTIES:
:CUSTOM_ID: h:completion-minibuffer-1
:END:

在学习章节提到过[[h:learn-completion-minibuffer-1][(增强 minibuffer 补全：vertico 和 Orderless)]]

#+begin_src emacs-lisp :tangle "lisp/init-completion.el"
  ;;; 增强 minibuffer 补全：vertico 和 Orderless

  (use-package vertico
    :ensure t
    :init (vertico-mode))

  (use-package orderless
    :ensure t
    :after vertico
    :init (setq completion-styles '(orderless)))
#+end_src

有了 vertico-mode，把之前的 icomplete-mode 关掉。 补全变为垂直，垂直对于我们是更友好的，所有 minibuffer 的行为的可以补全。如使用 =M-x= 补全变为垂直,  =C-x C-f= 增强显示目录下文件、 =C-x b= 变为垂直。

orderless 支持 =M-x= 模糊搜索，可以无序的。 如 edebug-defun 函数搜索， =M-x fun debug=

*** =init-completion.el= 配置 Marginalia 增强 minubuffer 的 annotation
:PROPERTIES:
:CUSTOM_ID: h:completion-minibuffer-2
:END:

在学习章节提到过[[h:learn-completion-minibuffer-2][(配置 Marginalia 增强 minubuffer 的 annotation)]]

#+begin_src emacs-lisp :tangle "lisp/init-completion.el"
  ;;; 配置 Marginalia 增强 minubuffer 的 annotation
  (use-package marginalia
    :ensure t
    :init (marginalia-mode)
  )
#+end_src

=M-x= 可以看到它会把命令的注释直接显示在minibuffer中

=C-h v= 查看一个变量的内容，可以发现不用再按回车看到里面的值。直接显示在minibuffer中

=C-h f= 键位绑定都已经在minibuffer中显示出来了

=C-x C-f= 显示文件大小权限等， =C-x b= 显 buffer 大小状态， =C-h f= 显示函数快捷键等

*** =init-completion.el= minibuffer action 和自适应的 context menu：Embark
:PROPERTIES:
:CUSTOM_ID: h:completion-minibuffer-3
:END:

在学习章节提到过[[h:learn-completion-minibuffer-3][(minibuffer action 和自适应的 context menu：Embar)]]

#+begin_src emacs-lisp :tangle "lisp/init-completion.el"
  ;;; minibuffer action 和自适应的 context menu：Embark
  (use-package embark
    :ensure t
    :init
    ;; Optionally replace the key help with a completing-read interface
    (setq prefix-help-command #'embark-prefix-help-command)
    :config
    ;; Hide the mode line of the Embark live/completions buffers
    (add-to-list 'display-buffer-alist
                 '("\\`\\*Embark Collect \\(Live\\|Completions\\)\\*"
                   nil
                   (window-parameters (mode-line-format . none))))
    :bind
    (("C-;" . embark-act)         ;; pick some comfortable binding
     )) ;; alternative for `describe-bindings'
#+end_src

使用

光标在函数位置，按 =C-;= 
- RET 查看光标处函数定义文件位置，并打开
- c 修改变量的值
  - 如 C-h v 变量名，按 C-; c 修改变量的值

优点：不需要记快捷键了
- 以前查看函数的绑定键
  - ~C-h b~ 查看函数快捷键绑定：
  - 以前按 =C-x C-h= 时，会告诉你 =C-x= 绑定了哪些快捷键
- 设置了 =(setq prefix-help-command #'embark-prefix-help-command)= 后
  - 按 =C-x C-h= 模糊输入函数名可看到绑定的快捷键，按回车可直接执行命令，就不需要再记快捷键了

*** =init-completion.el= 增强文件内搜索Consult
:PROPERTIES:
:CUSTOM_ID: h:completion-minibuffer-4
:END:

在学习章节提到过[[h:learn-completion-minibuffer-4][(增强文件内搜索和跳转函数定义：Consult)]]

#+begin_src emacs-lisp :tangle "lisp/init-completion.el"
  ;;; 增强文件内搜索和跳转函数定义：Consult
  (use-package consult
    :ensure t
    ;;replace swiper 可以替代老的 ivy mode 的 swiper 功能
    :bind (
           ("C-s" . consult-line) ;; replace swipe
           ("M-s i" . consult-imenu)  ;跳转函数定义
           ;;("C-x b" .  consult-buffer) ;; 多显示最近打开文件。替换默认 C-x b buffer
           ;;("C-c p s" . consult-ripgrep) ;;  查找文件内容，需要安装 ripgrep 命令
           )
    )
#+end_src

使用 =C-s= 搜索的内容就会在minibuffer中垂直显示，使用C-p 或 C-n来上下选择

使用 =M-s i= 跳转函数定义或者org-mode标题

这些组合可以秒杀ivy helm这种一统的插件。

**** =init-completion.el= 增强 embark 和 consult，批量搜索替换大杀器
:PROPERTIES:
:CUSTOM_ID: h:completion-minibuffer-4-1
:END:

在学习章节提到过[[#h:learn-completion-minibuffer-4-1][(增强 embark 和 consult，批量搜索替换大杀器)]]

性能： grep < ack < ag < ripgrep(rg)

使用ripgrep来进行搜索, =M-x consult-ripqgrep= 搜索hello 会出现报错找不到rg命令。

#+begin_example
Error running timer: (file-missing "Searching for program" "No such file or directory" "rg")
#+end_example

下载ripgrep: <https://github.com/BurntSushi/ripgrep> msys2 <https://packages.msys2.org/base/mingw-w64-ripgrep>

安装方式：
- PC msys2 ~pacman -S mingw-w64-x86_64-ripgrep~
- PC github release 下载windows包，解压并加入到PARH变量中
- Arch Linux  ~sudo pacman -S ripgrep~
- macOS ~brew install ripgrep~

再使用ripgrep来进行搜索, =M-x consult-ripgrep= 搜索hello ，所有当前目录下包含hello字符串的信息都在minibuffer中展示出来了。 使用 =C-n= 或 =C-p= 来预览文件或进入文件里。

*下面介绍批量修改插件*



#+begin_src emacs-lisp :tangle "lisp/init-completion.el"
  ;;; 批量修改文件内容
  (use-package embark-consult
    :ensure t)

  (use-package wgrep
    :ensure t)

  (setq wgrep-auto-save-buffer t)

  (eval-after-load 'consult
    '(eval-after-load 'embark
       '(progn
          (require 'embark-consult)
          (add-hook 'embark-collect-mode-hook #'consult-preview-at-point-mode)))) ;hook 第一个参数执行前，先执行第2个参数的功能

  (define-key minibuffer-local-map (kbd "C-c C-e") 'embark-export-write)
  #+end_src

批量替换操作
- ~M-x consult-ripgrep~  默认会在以 git 为根目录搜索。如 =#hello= ，搜索包含hello字符的文件。 ~C-n/C-p~ 下上搜索同时可以预览。
- ~C-c C-e~ 打开写
- ~M-x query-replace-regexp~ 输入hello 回车， 替换为hello 回车。 按 y 同意当前行替换，n 不同意修改
- ~C-c C-c~ 执行替换，按 q 退出


当前buffer替换操作
- =C-s= 搜索， 输入hello
- =C-c C-e= 编辑
- ~M-x query-replace-regexp~ 输入要替换的内容
- ~C-c C-c~ 执行替换，按 q 退出

*配置搜索中文文件*

everythin工具可以快速搜索本地文件。下载地址： <https://www.voidtools.com/zh-cn/downloads/>

安装好后，同时下载 ES.exe 客户端工具加入环境变量。

#+begin_src emacs-lisp :tangle "lisp/init-completion.el"
  ;;; 配置搜索中文文件
  ;; PC提前安装 everyting 及其客户端ES. 利用M-x consult-locate搜索
  (progn
    (setq consult-locate-args (encode-coding-string "es.exe -i -p -r" 'gbk))
    (add-to-list 'process-coding-system-alist '("es" gbk . gbk))
    )
  (eval-after-load 'consult
    (progn
        (setq
          consult-narrow-key "<"
          consult-line-numbers-widen t
          consult-async-min-input 2         ;; 搜索 2 个字符显示输出。默认 3
          consult-async-refresh-delay  0.15
          consult-async-input-throttle 0.2
          consult-async-input-debounce 0.1)
        ))
#+end_src

操作：
- 前提：PC 始终打开everything, 转为ES会调用everthing
- =M-x consult-locate= 回车，输入要搜索的文件如 =#init.el= 。 可以看到minibuffer中显示的和everthing界面搜索的是一样的。
- 再输入个#号就可以使用 orderless 的功能进行过滤。如只想看29.4中init.el文件 =#init.el#29.4= 选中回车即可打开对应文件

使用外部程序打开：
- =M-x consult-locate= 回车，输入要搜索的文件. 如搜索projeckt中的txt文件 =#\.txt#project=
- 使用embark =C;=  按x使用外部程序打开txt文件

中文搜索操作：
- =M-x consult-locate= 回车，输入要搜索的文件. 如 =#学习=

*** =init-completion.el= 调用 provide

#+begin_src emacs-lisp :tangle "lisp/init-completion.el"
  (message "Load init-completion done...")
  (provide 'init-completion)
#+end_src

** =init-tools.el=

