emacs/.emacs.d/jasper-emacs.org
*** =init-tools.el= config

#+begin_src emacs-lisp :tangle "lisp/init-tools.el" :mkdirp yes
  ;;; 窗口标签
  ;;(add-to-list 'load-path (expand-file-name "~/.emacs.d/site-lisp/awesome-tab/"))
  ;;(require 'awesome-tab)
  ;;(awesome-tab-mode t)

  (defun awesome-tab-buffer-groups ()
  "`awesome-tab-buffer-groups' control buffers' group rules.
  Group awesome-tab with mode if buffer is derived from `eshell-mode' `emacs-lisp-mode' `dired-mode' `org-mode' `magit-mode'.
  All buffer name start with * will group to \"Emacs\".
  Other buffer group by `awesome-tab-get-group-name' with project name."
  (list
  (cond
      ((or (string-equal "*" (substring (buffer-name) 0 1))
          (memq major-mode '(magit-process-mode
                              magit-status-mode
                              magit-diff-mode
                              magit-log-mode
                              magit-file-mode
                              magit-blob-mode
                              magit-blame-mode)))
      "Emacs")
      ((derived-mode-p 'eshell-mode)
      "EShell")
      ((derived-mode-p 'dired-mode)
      "Dired")
      ((memq major-mode '(org-mode org-agenda-mode diary-mode))
      "OrgMode")
      ((derived-mode-p 'eaf-mode)
      "EAF")
      (t
       (awesome-tab-get-group-name (current-buffer))))))
#+end_src

*** =init-tools.el= 使用拼音进行搜索
:PROPERTIES:
:CUSTOM_ID: h:tools-search-pinyin
:END:

在学习章节提到过[[#h:learn-tools-search-pinyin][(使用拼音进行搜索)]]

#+begin_src emacs-lisp :tangle "lisp/init-tools.el"
  ;;; 使用拼音进行搜索
  ;;ivy
  ;; Encoding
  ;; UTF-8 as the default coding system
  ;;(when (fboundp 'set-charset-priority)
  ;;  (set-charset-priority 'unicode))

  ;;(set-language-environment 'chinese-gbk)
  ;;(prefer-coding-system 'utf-8-auto)


  (use-package pyim
    :ensure t)

  (defun eh-orderless-regexp (orig_func component)
    (let ((result (funcall orig_func component)))
      (pyim-cregexp-build result)))


  (defun toggle-chinese-search ()
    (interactive)
    (if (not (advice-member-p #'eh-orderless-regexp 'orderless-regexp))
        (advice-add 'orderless-regexp :around #'eh-orderless-regexp)
      (advice-remove 'orderless-regexp #'eh-orderless-regexp)))

  (defun disable-py-search (&optional args)
    (if (advice-member-p #'eh-orderless-regexp 'orderless-regexp)
        (advice-remove 'orderless-regexp #'eh-orderless-regexp)))

  ;; (advice-add 'exit-minibuffer :after #'disable-py-search)
  (add-hook 'minibuffer-exit-hook 'disable-py-search) ;退出minibuffer时自动退出拼音搜索

  (global-set-key (kbd "s-p") 'toggle-chinese-search) ;需要时打开拼音搜索。因为拼音搜索性能不稳定
#+END_SRC

*** =init-tools.el= keycast
:PROPERTIES:
:CUSTOM_ID: h:tools-keycast
:END:

modeline上显示我的所有的按键和执行的命令

#+begin_src emacs-lisp :tangle "lisp/init-tools.el"
  ;;; modeline上显示我的所有的按键和执行的命令
  (use-package keycast
    :ensure t
    :init (keycast-mode-line-mode 1)) ; 在标题显示
#+end_src

在使用doom-modeline上面配置会报错。这里用下面的配置

*** =init-tools.el= 调用 provide

#+begin_src emacs-lisp :tangle "lisp/init-tools.el"
  (message "Load init-tools done...")
  (provide 'init-tools)
#+end_src

** =init-ui.el=

*** =init-ui.el= 内置配置
:PROPERTIES:
:CUSTOM_ID: h:ui-built-in
:END:

在学习章节提到过[[h:learn-ui-built-in][(外观配置)]]

#+begin_src emacs-lisp :tangle "lisp/init-ui.el" :mkdirp yes
  (global-display-line-numbers-mode 1) ;显示行号 29版本。29之前用(global-linum-mode 1)
  (setq inhibit-startup-screen t) ; 尝试关掉启动界面
  ;;(toggle-frame-maximized)                     ; 全屏编辑器


  ;;(set-face-attribute 'default nil :height 150) ; 修改字号，大小为16pt
  ;;让鼠标滚动更好用。默认滚动很快
  (setq mouse-wheel-scroll-amount '(3 ((shift) . 1) ((control) . nil)))
  (setq mouse-wheel-progressive-speed nil)

  (tool-bar-mode -1)                           ;; 关闭工具栏，tool-bar-mode 即为一个 Minor Mode
  (scroll-bar-mode -1)                         ;; 关闭文件滑动控件
  ;; (menu-bar-mode -1)                        ;; 关闭菜单栏 (不关闭，使用插件时会用到)

  (setq-default cursor-type 'bar)              ; 更改光标的样式，默认比较粗. 更多C-h v 查询帮助
  ;;(setq cursor-type 'bar)                    ;; 更改光标的样式。setq当前buffer生效，不能全局生效

  (global-hl-line-mode t)                      ;; 高亮当前行

  ;;主题
  ;;(load-theme 'tango-dark) ;这里使用doom-theme
#+end_src

*** =init-ui.el= doom-emacs
:PROPERTIES:
:CUSTOM_ID: h:ui-doom-emacs
:END:

#+begin_src emacs-lisp :tangle "lisp/init-ui.el"
  ;; 这里的执行顺序非常重要，doom-modeline-mode 的激活时机一定要在设置global-mode-string 之后‘
  (use-package doom-themes
    :ensure t)
  (load-theme 'doom-one 1)

  (use-package doom-modeline
    :ensure t
    :custom-face
    (mode-line ((t (:height 0.9))))
    (mode-line-inactive ((t (:height 0.9))))
    :init
    (doom-modeline-mode t))
#+end_src

#+begin_src emacs-lisp :tangle no
  (use-package doom-themes
    :ensure t)
  (load-theme 'doom-one 1)

  (use-package doom-modeline
    :ensure t
    :custom-face
  (mode-line ((t (:height 0.9))))
  (mode-line-inactive ((t (:height 0.9))))
    :init
    (doom-modeline-mode t))
#+end_src

*** =init-ui.el= 调用 provide

#+begin_src emacs-lisp :tangle "lisp/init-ui.el"
  (message "Load init-ui done...")
  (provide 'init-ui)
#+end_src

** =init-org.el=

*** =init-org.el= 内置配置

#+begin_src emacs-lisp :tangle "lisp/init-org.el" :mkdirp yes
  ;;; config

  ;;; 使用旧版快捷键<s +Tab
  (with-eval-after-load 'org
    (require 'org-tempo))

  ;; 禁用左尖括号
  (setq electric-pair-inhibit-predicate
        `(lambda (c)
           (if (char-equal c ?\<) t (,electric-pair-inhibit-predicate c))))

  (add-hook 'org-mode-hook
            (lambda ()
              (setq-local electric-pair-inhibit-predicate
                          `(lambda (c)
                             (if (char-equal c ?\<) t (,electric-pair-inhibit-predicate c))))))
#+end_src

*** =init-org.el= 安装最新org包

#+begin_src emacs-lisp :tangle "lisp/init-org.el"
  ;;; 安装 org，这个配置一定要配置在 use-package 的初始化之前，否则无法正常安装
  (assq-delete-all 'org package--builtins)
  (assq-delete-all 'org package--builtin-versions)
  (use-package org
    :pin gnu-elpa
    :ensure t)

  (use-package org-contrib  ;非org的官方贡献的插件
    :ensure t
    :pin nongnu)

 

#+end_src

*** =init-org.el= org todo


#+begin_src emacs-lisp :tangle "lisp/init-org.el"
  ;;; 自定义org todo  C-c C-t 
  (setq org-todo-keywords
        (quote ((sequence "TODO(t)" "STARTED(s)" "|" "DONE(d!/!)")
                (sequence "WAITING(w@/!)" "SOMEDAY(S)" "|" "CANCELLED(c@/!)" "MEETING(m)" "PHONE(p)"))))
#+end_src

以上代码让你在为一个标题提供待办事项状态时添加了一个键序列，你可以键入 =C-c C-t= 来查看效果。

其中 =@= 代表记录日志，而 =!= 代表记录时间戳，你也可以让他们具有两种功能: =TODO(t@/!)=

*任务进度* ：

创建文件 =~/gtd.org=
#+begin_src org
,* WAITING Daily routine
- [ ] leetcode
- [ ] execrcise
#+end_src


#+begin_src org
,* TODO Daily routine [100%]
SCHEDULED: <2022-06-10 Fri 10:00 +1d>
:PROPERTIES:
:LAST_REPEAT: [2022-06-09 Thu 02:31]
:END:
- State "DONE"       from "TODO"       [2022-06-09 Thu 02:31]
- State "TODO"       from "WAITING"    [2022-06-09 Thu 02:26]
- [X] leetcode
- [X] execrcise
#+end_src

- =C-c C-s= 开始计划： =<2022-06-09 Thu 10:00>= 10点
  
- 每天 10 点做：需要 =+d= 加一天 =SCHEDULED: <2022-06-09 Thu 10:00 +1d>= ，后面在 agenda 中会用到
  
- 完成情况进度：每一项任务使用复选框，todo 部分加 =[%]= ，复选框使用 =C-c C-c= 打 叉 表示完成。

标记完成：=C-c C-t d= ，可以看到 =SCHEDULED= 时间自动加 1 =SCHEDULED: <2022-06-10 Fri 10:00 +1d>=

#+begin_src org
  ,* TODO Daily routine [100%]
  SCHEDULED: <2022-06-10 Fri 10:00 +1d>
  :PROPERTIES:
  :LAST_REPEAT: [2022-06-09 Thu 02:31]
  :END:
  - State "DONE"       from "TODO"       [2022-06-09 Thu 02:31]
  - State "TODO"       from "WAITING"    [2022-06-09 Thu 02:26]
  - [X] leetcode
  - [X] execrcise
#+end_src

不过进入新的计划，每一项还需要新状态。这很麻烦，所以这边用另一个插件包 org-contrib。
目的是要引入 check list

#+begin_src emacs-lisp :tangle "lisp/init-org.el"
  (require 'org-checklist)
  ;; need repeat task and properties
  (setq org-log-done t)
  (setq org-log-into-drawer t)
#+end_src

通过 =M-x org-set-property=  添加 =RESET_CHECK_BOXES= 。 =RESET_CHECK_BOXES=  设置为 =t= 开启， 会在 =PROPERTIES= 中增加属性。

当 =C-c C-t d= 把标题设置为 DONE，自动进入下一个时间点。 这对自定义一些重复性工作比较方便。


#+begin_src org
  ,* TODO Daily routine [0%]
  SCHEDULED: <2022-06-15 Wed 10:00 +1d>
  :PROPERTIES:
  :LAST_REPEAT: [2022-06-09 Thu 07:24]
  :RESET_CHECK_BOXES: t
  :END:
  - State "DONE"       from "TODO"       [2022-06-09 Thu 07:24]
  - State "DONE"       from "TODO"       [2022-06-09 Thu 02:31]
  - State "TODO"       from "WAITING"    [2022-06-09 Thu 02:26]
  - [ ] leetcode
  - [ ] execrcise
#+end_src

每次完成任务会自动插入完成状态，使用下面设置可以隐藏到 =PROPERTIES= 里：
#+begin_src emacs-lisp
;; need repeat task and properties
(setq org-log-done t)
(setq org-log-into-drawer t)
#+end_src

使用 =C-c C-t d= 完成任务， 完成状态会增加到 =LOGBOOK= 属性中。把之前的状态手动移过来。
#+begin_src org
,* TODO Daily routine [0%]
SCHEDULED: <2022-06-17 Fri 10:00 +1d>
:PROPERTIES:
:LAST_REPEAT: [2022-06-09 Thu 07:44]
:RESET_CHECK_BOXES: t
:END:
:LOGBOOK:
- State "DONE"       from "TODO"       [2022-06-09 Thu 07:44]
- State "DONE"       from "TODO"       [2022-06-09 Thu 07:34]
- State "DONE"       from "TODO"       [2022-06-09 Thu 07:24]
- State "DONE"       from              [2022-06-09 Thu 03:03]
- State "DONE"       from              [2022-06-09 Thu 02:50]
- State "DONE"       from "TODO"       [2022-06-09 Thu 02:31]
- State "TODO"       from "WAITING"    [2022-06-09 Thu 02:26]  
:END:
- [ ] leetcode
- [ ] execrcise
#+end_src


*** =init-org.el= org agenda

相当于有一个日历实时告诉你每天要做什么。通过 =M-x org-agenda= 来打开. 这里需要一个存放日程的目录，同时绑定快捷键 =C-c a= 方便查看。


#+begin_src emacs-lisp :tangle "lisp/init-org.el"
  ;; C-c C-s schedule
  ;; C-c C-d deadline
  (global-set-key (kbd "C-c a") 'org-agenda)
  (setq org-agenda-files '("~/gtd.org")) ;; 定义 agenda 文件，可以是多个
  (setq org-agenda-span 'day) ;; 按天观察
#+end_src

基本操作：
- =C-c a a=  可以看到每周日程。
- =f/b= 下一个/上一个阶段安排, =d/w= 天/周视图，=n/p= 上/下移动光标 
- 在 =~/gtd.org= 设置 deadline =C-c C-d= ，在日程中也能看到。
  

*** =init-org.el= org capture

#+begin_src emacs-lisp :tangle "lisp/init-org.el"
  (setq org-capture-templates
        '(("t" "Todo" entry (file+headline "~/gtd.org" "Workspace")
           "* TODO [#B] %?\n  %i\n %U"
           :empty-lines 1)))

  (global-set-key (kbd "C-c r") 'org-capture)
#+end_src

这个模板包含五个部分，分别是

| 模板组成     | 对应默认模板中的内容                      | 描述             |
| key         | "t"                                     | 用来选择模板的字符 |
| description | "Todo"                                  | 展示用的模板描述   |
| type        | entry                                   | 新增内容的类型    |
| target      | (file+headline "~/gtd.org" "Workspace") | 新增内容的存储位置 |
| template    | "* TODO [#B] %?\n  %i\n %U"             | 新增内容的模板    |

新增内容的模板:
- "%?" 是一个更特殊的标记，它不会产生任何内容，当所有其他的特殊标记都展开完毕或者输入完毕后，光标将会停留在这个标记所在的位置。
- %i 可以插入一段初始化内容
- %U  当前包含日期和时间的未激活的 timestamp，如: [2018-03-04 日 19:26] 

定义捕获模板，绑定到快捷键 =C-c r= 。 更写详细的参考官方文档。

操作：
- =C-c a t= 向指定文件中写内容。 =C-c C-c= 完成


*** =init-org.el= org effect

#+begin_src emacs-lisp :tangle "lisp/init-org.el"


#+end_src

*** =init-org.el= org tags

#+begin_src emacs-lisp :tangle "lisp/init-org.el"


#+end_src

*** =init-org.el= org priority

#+begin_src emacs-lisp :tangle "lisp/init-org.el"


#+end_src

*** =init-org.el= 调用 provide

#+begin_src emacs-lisp :tangle "lisp/init-org.el"
  (message "Load init-org done...")
  (provide 'init-org)
#+end_src

** =init-keybindings.el=

*** =init-keybindings.el= config

#+begin_src emacs-lisp :tangle "lisp/init-keybindings.el" :mkdirp yes
  ;;; config

#+end_src

